tutorials/PowderBed/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.10                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.00001;

vertices
(
 //   (-0.05 0 0)//0
   // (0.05 0 0)//1
//    (0.05 30 0)//2
//    (-0.05 30 0)//3
//    (-0.05 0 69)//4	//shoule be 69
//    (0.05 0 69)//5
//    (0.05 30 69)//6
//    (-0.05 30 69)//7

    (-0.05 -5 0)//0
    (0.05 -5 0)//1
    (0.05 15 0)//2
    (-0.05 15 0)//3
    (-0.05 -5 40)//4	//shoule be 69
    (0.05 -5 40)//5
    (0.05 15 40)//6
    (-0.05 15 40)//7



);
blocks
(
    hex (0 1 2 3 4 5 6 7) (1 240 480) simpleGrading (1 1 1)		//REGION 1



);

edges
(
);

boundary
(

    lowerWall
    {
        type wall;
        faces
        (
            (3 7 6 2)

        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    rightWall
    {
        type empty;
        faces
        (
            (1 2 6 5)
	    
        );
    }
    leftWall
    {
        type empty;
        faces
        (
            (0 4 7 3)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (0 3 2 1)
	    (5 6 7 4)
        );
    }
);

mergePatchPairs
(


);

// ************************************************************************* //
